zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam3XXe-pinctrl.h
/* pe11a_tc1_tioa4 */
#define PE11A_TC1_TIOA4 \
	SAM_PINMUX(e, 11, a, periph)

/* pe12_gpio */
#define PE12_GPIO \
	SAM_PINMUX(e, 12, gpio, gpio)

/* pe12a_tc1_tiob4 */
#define PE12A_TC1_TIOB4 \
	SAM_PINMUX(e, 12, a, periph)

/* pe13_gpio */
#define PE13_GPIO \
	SAM_PINMUX(e, 13, gpio, gpio)

/* pe13a_tc1_tioa5 */
#define PE13A_TC1_TIOA5 \
	SAM_PINMUX(e, 13, a, periph)

/* pe14_gpio */
#define PE14_GPIO \
	SAM_PINMUX(e, 14, gpio, gpio)

/* pe14a_tc1_tiob5 */
#define PE14A_TC1_TIOB5 \
	SAM_PINMUX(e, 14, a, periph)

/* pe15_gpio */
#define PE15_GPIO \
	SAM_PINMUX(e, 15, gpio, gpio)

/* pe15a_pwm_pwmh0 */
#define PE15A_PWM_PWMH0 \
	SAM_PINMUX(e, 15, a, periph)

/* pe16_gpio */
#define PE16_GPIO \
	SAM_PINMUX(e, 16, gpio, gpio)

/* pe16a_pwm_pwmh1 */
#define PE16A_PWM_PWMH1 \
	SAM_PINMUX(e, 16, a, periph)

/* pe16b_usart3_sck */
#define PE16B_USART3_SCK \
	SAM_PINMUX(e, 16, b, periph)

/* pe17_gpio */
#define PE17_GPIO \
	SAM_PINMUX(e, 17, gpio, gpio)

/* pe17a_pwm_pwml2 */
#define PE17A_PWM_PWML2 \
	SAM_PINMUX(e, 17, a, periph)

/* pe18_gpio */
#define PE18_GPIO \
	SAM_PINMUX(e, 18, gpio, gpio)

/* pe18a_pwm_pwml0 */
#define PE18A_PWM_PWML0 \
	SAM_PINMUX(e, 18, a, periph)

/* pe18b_ebi_ncs6 */
#define PE18B_EBI_NCS6 \
	SAM_PINMUX(e, 18, b, periph)

/* pe19_gpio */
#define PE19_GPIO \
	SAM_PINMUX(e, 19, gpio, gpio)

/* pe19a_pwm_pwml4 */
#define PE19A_PWM_PWML4 \
	SAM_PINMUX(e, 19, a, periph)

/* pe20_gpio */
#define PE20_GPIO \
	SAM_PINMUX(e, 20, gpio, gpio)

/* pe20a_pwm_pwmh4 */
#define PE20A_PWM_PWMH4 \
	SAM_PINMUX(e, 20, a, periph)

/* pe20b_hsmci_mccdb */
#define PE20B_HSMCI_MCCDB \
	SAM_PINMUX(e, 20, b, periph)

/* pe21_gpio */
#define PE21_GPIO \
	SAM_PINMUX(e, 21, gpio, gpio)

/* pe21a_pwm_pwml5 */
#define PE21A_PWM_PWML5 \
	SAM_PINMUX(e, 21, a, periph)

/* pe22_gpio */
#define PE22_GPIO \
	SAM_PINMUX(e, 22, gpio, gpio)

/* pe22a_pwm_pwmh5 */
#define PE22A_PWM_PWMH5 \
	SAM_PINMUX(e, 22, a, periph)

/* pe22b_hsmci_mcdb0 */
#define PE22B_HSMCI_MCDB0 \
	SAM_PINMUX(e, 22, b, periph)

/* pe23_gpio */
#define PE23_GPIO \
	SAM_PINMUX(e, 23, gpio, gpio)

/* pe23a_pwm_pwml6 */
#define PE23A_PWM_PWML6 \
	SAM_PINMUX(e, 23, a, periph)

/* pe24_gpio */
#define PE24_GPIO \
	SAM_PINMUX(e, 24, gpio, gpio)

/* pe24a_pwm_pwmh6 */
#define PE24A_PWM_PWMH6 \
	SAM_PINMUX(e, 24, a, periph)

/* pe24b_hsmci_mcdb1 */
#define PE24B_HSMCI_MCDB1 \
	SAM_PINMUX(e, 24, b, periph)

/* pe25_gpio */
#define PE25_GPIO \
	SAM_PINMUX(e, 25, gpio, gpio)

/* pe25a_pwm_pwml7 */
#define PE25A_PWM_PWML7 \
	SAM_PINMUX(e, 25, a, periph)

/* pe26_gpio */
#define PE26_GPIO \
	SAM_PINMUX(e, 26, gpio, gpio)

/* pe26a_pwm_pwmh7 */
#define PE26A_PWM_PWMH7 \
	SAM_PINMUX(e, 26, a, periph)

/* pe26b_hsmci_mcdb2 */
#define PE26B_HSMCI_MCDB2 \
	SAM_PINMUX(e, 26, b, periph)
